## СТРУКТУРА ВЕБ-СТРАНИЦЫ ###
'''
1. Tag – элемент или тег - <p>Здесь написан текст.</p>
2. Attribute – атрибуты или свойства элемента
- class -- <div class="simple-text main">...</div>
- name -- <a name="top"></a>
- id -- уникальный указатель на элемент,  чаще всего генерируются динамически самим фреймворком
3. Иерархия в HTML-документах
'''
# data-атрибуты
'''
title - универсальный атрибут, задаёт всплывающую подсказку по наведению на элемент
href - для тега <a> задаёт адрес ссылки
target - для тега <a> указывает, как именно открыть ссылку: в текущем окне или в новом
src - для тега <img> задает ссылку на источник изображения
placeholder - для тега <input> добавляет текст внутри текстового поля, который исчезает при получении фокуса
required - для тега <input> помечает поле как обязательное для заполнения
type - для тега <input> указывает, какой тип информации будет вводиться пользователем
checked - для тега <input> указывает на то, выбран ли заранее флажок-переключатель
disabled - для тега <button> указывает на то, что кнопка заблокирована
'''
